{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "1", "default_text": "retrieval system improving effectiveness", "description": "What papers focus on improving the effectiveness of a retrieval system?", "narrative": "Relevant papers include research on what makes a retrieval system effective and what improves the effectiveness of a retrieval system. Papers that focus on improving something else or improving the effectiveness of a system that is not a retrieval system are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "2", "default_text": "machine learning language identification", "description": "What papers are about machine learning for language identification?", "narrative": "Relevant papers include research on methods of machine learning for language identification or how to improve those methods. Papers that focus on other methods for language identification or the usaged of machine learning not for language identification are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "3", "default_text": "social media detect self-harm", "description": "Which papers focus on how to recognize signs of self-harm in people's social media posts?", "narrative": "Relevant papers include research on early detection of self-harm on social media platforms such as Facebook, Instagram, Reddit, Twitter and co. Papers that addresses mental health issues like depression or anorexia are not relevant. Furthermore, papers that deal with self-harm but are not related to social media are also not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "4", "default_text": "stemming for arabic languages", "description": "Which papers focus on improving stemming in arabic languages?", "narrative": "Relevant papers include research on stemming methods for arabic languages or how to improve those methods. Papers that focus on stemming in other languages are not relevant, as well as papers that do not focus on stemming."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "5", "default_text": "audio based animal recognition", "description": "Which papers focus on classifying animal species by sound?", "narrative": "Relevant papers focus on recognizing the species of animals or sub-classes of animals via their sound profile. Papers that focus on other audio recognition fields such as music are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "6", "default_text": "Comparison different retrieval models", "description": "Which different retrieval models exist and what are their similarities and differences?", "narrative": "Relevant documents include the description and comparison of at least two different retrieval models. Documents containing only information about one specific retrieval model are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "7", "default_text": "Cache architecture", "description": "How are caches composed and how does their architecture function?", "narrative": "Relevant documents include the description of the structure of a cache. Documents that only provide general information about caches and their function are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "8", "default_text": "Document scoping formula", "description": "How was the formula for document scoping developed?", "narrative": "Relevant documents include information about how the formula for document scoping was derived from it's variables. Documents only using the formula are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "9", "default_text": "Pseudo-relevance feedback", "description": "How does pseudo-relevance feedback improve a query?", "narrative": "Documents that specifically showcase how this method is used to improve the query are relevant. Documents which prove the effectiveness of the method are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "10", "default_text": "How to represent natural conversations in word nets", "description": "How is it possible to filter and classify information that can be found in chats and interviews?", "narrative": "Relevant documents include information about effective complexity reduction of natural conversations and how to put the extracted content in an order. Not relevant documents are those who speak about data bases and artifically obtained data."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "11", "default_text": "Algorithm acceleration with Nvidia CUDA", "description": "Developing new algorithms and improving the existing ones leveraging a graphics processing unit with CUDA", "narrative": "Relevant entries only include information about the Nvidia CUDA computing platform. Entries not mentioning CUDA as the main tool are irrelevant. Entries about other computing platforms, such as AMD ROCm are irrelevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "12", "default_text": "mention of algorithm", "description": "What entries mention algorithms in their abstract?", "narrative": "Relevant entries mention algorithms as part of their work. Entries containing one or more algorithms are both relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "13", "default_text": "at least three authors", "description": "Which entries have at least three authors?", "narrative": "Relevant entries have at least three authors. Entries containing only one or two authors are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "14", "default_text": "German domain", "description": "Which entries include German domains?", "narrative": "Relevant entries include links with a German domain. Entries ending with .de are relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "15", "default_text": " mention of open source ", "description": " Which entries mention open source software/projects ", "narrative": "Relevant entries mention open source projects or software. Entries containing the phrase \"open source\" are relevant. "}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "16", "default_text": "Inclusion of text-mining", "description": "Which entries mention text-mining?", "narrative": "Relevant entries mention text-mining as one of their methods. Entries including text-mining, e. g. in their abstract or keywords."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "17", "default_text": "The Ethics of Artificial Intelligence", "description": "What are the ethical considerations surrounding the development and use of artificial intelligence?", "narrative": "Relevant entries should explore the ethical issues related to artificial intelligence, including accountability and responsibility, privacy and surveillance, job displacement, and the potential for AI to be used for harm."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "19", "default_text": "machine learning for more relevant results", "description": "Which papers describe methods to find more relevant results using machine learning?", "narrative": "Relevant papers describe one or more methods to find more relevant results using machine learning. Papers about just machine learning in IR in general or papers just about finding more relevant results are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "20", "default_text": "Crawling websites using machine learning", "description": "Papers that describe how to use AI to crawl the context of websites more efficient.", "narrative": "Papers in this topic describe methods and algorithms to use machine learning for crawling. They also contain information on the latest research findings on the topic. Papers about crawling methods without AI are not relevant for this topic."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "21", "default_text": "Recommenders influence on users", "description": "Papers that describe the change in user behaviour because of recommenders?", "narrative": "Relevant papers describe how users are affected by recommenders, papers about the recommenders from a technological point of view are not relevant"}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "22", "default_text": "Search engine caching effects", "description": "Papers that describe the effects and/or efficient use of search engine caching in terms of result freshness, query latency and other potential advantages or disadvantages ", "narrative": "Papers in this topic will describe the design trade-off between low latency querying and returning the most recently available results as well as different architectures to create efficient caching systems. Results should not contain any other caching related topics (e.g. hardware or web browsers)"}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "23", "default_text": "Consumer Product reviews", "description": "Papers that describe the effects of product reviews on consumer decisions", "narrative": "Relevant papers would describe the influence that reviews have on individual decisions of the consumer on whether to buy a product or not. Not relevant papers, would contain other studies about reviews, that are not pertaining to human psychology"}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "24", "default_text": "Limitations machine learning", "description": "Which papers describe the limitations of machine learning?", "narrative": "Relevant papers describe the limitations of machine learning ( e.g. dependence on data quality and quantity, limited ability to handle complex tasks, vulnerability to disturbances and attacks, need for resources and energy). Papers that contains machine learning but not its limitations are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "25", "default_text": "medicine related research", "description": "Papers that did research on medical data", "narrative": "Find papers that did their research on medical data"}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "26", "default_text": "Natural Language Processing", "description": "Find papers that include the term natural language processing", "narrative": ""}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "27", "default_text": "graph based ranking", "description": "Papers that are written about the method of graph based ranking", "narrative": "Find papers that are about graph based ranking. Other papers are not relevant"}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "28", "default_text": "medical studies that use information retrieval ?", "description": "What documents show information retrieval techniques used in medical studies ?", "narrative": "Relevant documents show information retrieval used in medical studies. Documents that do not look at medical studies and information retrieval are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "29", "default_text": "information retrieval on different language sources ?", "description": "What articles identify the impact of sources in different languages on information retrieval tasks ?", "narrative": "Relevant documents must concern more than one language. Documents have to identify the impact of the languages. Documents that only reference a single language or don't reference the impact of them are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "30", "default_text": "papers that compare multiple information retrieval methods", "description": "Which documents compare multiple information retrieval methods?", "narrative": "Relevant documents must contain comparisons between multiple information retrieval methods. Documents that only discuss one method are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "31", "default_text": " risks of information retrieval in social media ?", "description": " What are the risks associated with using information retrieval in social media?", "narrative": "Relevant documents must discuss the risks of using information retrieval in social media. Documents that only focus on general risks of social media or don't specifically address information retrieval are not relevant. Examples of relevant topics might include privacy concerns, potential for misinformation or manipulation, or the impact on mental health."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "32", "default_text": "actual experiments that strengthen theoretical knowledge", "description": "Which documents include actual experiments that strengthen theoretical knowledge about information retrieval? ", "narrative": "Relevant documents muss contain true experiments. Documents that do not include any experiments and only provide knowledge about information retrieval are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "33", "default_text": "fake news detection", "description": "All publications and workshops concerning the detection (identification) of fake news (disinformation, misinformation or deep fakes)", "narrative": "Relevant documents show the bigram of \"fake news\" or its synonyms in the context of their detection mechanisms."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "34", "default_text": " multimedia retrieval ", "description": " Which documents have information about multimedia information retrieval. ", "narrative": " To be relevant documents have to have methods and information of multimedia retrieval."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "35", "default_text": "processing natural language for information retrieval", "description": "Which documents contain informtion like problem definitions, methods, algorithms or challenges in processing natural language for information retrieval systems?", "narrative": "Relevant documents provide information about processing natural language associated with information retrieval. Documents containing information about information retrieval not associated with natural language or the other way round are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "36", "default_text": "recommendation systems", "description": "What documents contain information on recommendation systems (systems that suggest items to users based on their past behaviour and interests)", "narrative": "Relevant documents contain information or research on the topic of recommendation systems in the context of information retrieval."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "37", "default_text": "personalised search in e-commerce", "description": "Which papers include research on sentiment analysis in informational retrieval?", "narrative": "Papers that refer to the development and implementation of algorithms and techniques that use individual user data to provide personalised product recommendations and search results within an e-commerce context are relevant. This includes the collection and \tanalysis of user data such as browsing history, search queries, and purchase history, as well as the use of machine learning techniques to build user \tmodels and provide personalised recommendations.In general, topics that are not directly related to the development, implementation, or evaluation of personalised search algorithms in e-commerce may not be relevant to this topic."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "38", "default_text": "sentiment analysis", "description": "  Which papers include research on sentiment analysis in informational retrieval ", "narrative": " Relevant papers discuss techniques of sentiment analysis (e.g. multi-model sentiment analysis using neural networks). Not relevant are papers on analysis that involving sentiment analysis. Not relevant are papers on analysis of factual statements."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "39", "default_text": "informational retrieval using neural networks", "description": "  Which papers include research on using neural networks in informational retrieval ", "narrative": " Relevant papers discuss using neural networks to improve the effectiveness of information retrieval systems (e.g. natural language processing, deep learning and other machine learning approaches). Not relevant are papers on other types of machine learning or artificial intelligence that are to specifically designed for information retrieval (e.g. reinforcement learning or computer vision)."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "40", "default_text": "Query log analysis", "description": "Which papers include research on query log analysis in informational retrieval?", "narrative": "Papers that involves the analysis of logs of user search queries, as well as their corresponding search results and user interactions with those results are relevant. This includes insights into user behavior, search patterns and the use of this information to improve search engine performance and user experience.In general, topics that are not directly related to the study of user search behavior and search patterns, with the goal of improving search engine performance and user experience such as the study of search algorithms or system architecture and the technical details of search engine implementation are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "41", "default_text": "entity recognition", "description": "Retrieval of documents related to entity recognition.", "narrative": "Relevant documents should highlight entity recognition and its methods and applications. Documents that do not mention entity recognition are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "42", "default_text": "relevance assessments", "description": "Retrieval of documents related to relevance assessments.", "narrative": "Relevant documents should highlight relevance assessments and its methods and applications. Documents that do not mention relevance assessments are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "43", "default_text": "Deep Neural Networks", "description": "Which papers talk about Deep Neural Networks?", "narrative": "Relevant papers have at least one mention of Deep Neural. Paper containing only Deep or Neural are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "44", "default_text": "Information Retrieval", "description": "Which papers talk about Information Retrieval?", "narrative": "Relevant paper have at least one mention of Information Retrieval. Paper containing only Information or Retrieval are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "45", "default_text": "Analysis for Android apps", "description": "Which papers talk about the analysis of android apps?", "narrative": "Relevant papers talk at least in one line about android apps. Paper containing only apps are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "46", "default_text": "The University of Amsterdam", "description": "Which papers are created by the University of Amsterdam?", "narrative": "Relevant papers are created or at least co-written by the University of Amsterdam. Paper containing only\n      University not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "47", "default_text": "Neural Ranking for eCommerce Product Search", "description": "Which paper is about Ranking Product Search and its applications in eCommerce?", "narrative": "Relevant papers that addresses application of Task Models and Textual Embeddings in the field of electronic\n      commerce. Not relevant are papers showcasing applications that do not contain the topic eCommerce."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "48", "default_text": "web pages evolution", "description": "Which paper is about the evolution of web pages?", "narrative": "Relevant paper have at least one mention of web evolution. Paper containing only web page or evolution are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "49", "default_text": " exhaustivity of index ", "description": "Documents that include explanations for what exhaustivity means for an index. ", "narrative": "Relevant documents include the words index and/or indexing and exhaustivity in combination. Documents only containing indexing and/or index or only containing exhaustivity are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "50", "default_text": "query optimization", "description": "How can I optimize my queries and what are the main algorithms for them?", "narrative": "Relevant optimizations for queries and their respective algorithms in the information retrieval field. Documents not concerning the algorithmic approach behind queries are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "51", "default_text": " Cosine similarity vector ", "description": " How do I convert documents and queries into vectors for the cosine similarity? ", "narrative": " Relevant documents have the process of building the high-dimensional space out of documents and queries. The calculation of the angles via the cosine are not relevant. "}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "52", "default_text": " reverse indexing", "description": " What sources explain reverse indexing? ", "narrative": " Relevant sources that focus on reverse indexing. Sources that mention reverse indexing but does not explain reverse indexing are not relevant. "}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "53", "default_text": "index compression techniques", "description": "Which papers (abstracts) have information on techniques for index compression?", "narrative": "Relevant abstracts discuss index compression techniques. Abstracts that mention indexing but do not provide information about compression methods are not relevant. "}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "54", "default_text": "search engine optimization with query logs", "description": "What documents explain the optimization of a search engine that utilize query logs to do so?", "narrative": "Relevant documents include those referring to optimization and query logs. Those that only center one of these topics are not relevant. Any area of search engine optimization is relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "55", "default_text": "BM25", "description": "How does BM25 work?", "narrative": "Since BM25 is a very popular algorithm and I only used idf, I want to know the specific differences between the two."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "56", "default_text": " What makes Natural Language Processing natural? ", "description": "What is Natural Language Processing and why is it called natural?", "narrative": "Natural Language Processing is a model to process data regarding human language. It's called natural because you are not restricted to rules how the data produced by humans should look like."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "57", "default_text": "principle of a information retrieval indexing", "description": "How does indexing work in information retrieval?", "narrative": "Is the process of identifying and describing documents. These should then be classified for later analysis."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "58", "default_text": "Architecture of web search engine", "description": "How are web search engines composed and how does their architecture function?", "narrative": "Relevant documents include the description of the structure of a web search engine. Documents containing generel information about search engines or their history are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "59", "default_text": "What is AHP", "description": "What does the abbreviation AHP mean?", "narrative": "Relevant documents include what AHP is spelled out and what its definition is. Documents containing detailed usecases of AHP or abbreviiations of AHP outside of computer sience are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "60", "default_text": "What is information retrieval?", "description": "What topics are included in information retrieval and what is the goal of it? ", "narrative": "Relevant documents include a definition of information retrieval and a brief summory of the topics it covers. Documents containing in depth analysis of information retrieval algorithms are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "61", "default_text": "Efficient retrieval algorithms", "description": "Which retrieval algorithms work the fastest?", "narrative": "Relevant documents contain (pseudo) code examples and research of the time complexity for those algorithms. Not relevant are documents that contain a list of all possible retrieval algorithms."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "62", "default_text": "How to avoid spam results", "description": "Which techniques exist to deal with well-directed result manipulation and spam?", "narrative": "Relevant documents describe techniques to deal with manipulation or spam. Not relevant are documents, that just explain what result manipulation or spam is."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "63", "default_text": "Information Retrieval with algorithms", "description": "Using algorithms for effective Information Retrieval", "narrative": "Retrieve documents relevant to the query terms \"information retrieval\" and \"algorithms\""}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "64", "default_text": "misspellings in queries", "description": "Which documents cover query spelling autocorrection?", "narrative": "Relevant Information Retrieval documents cover the topic of misspellings in search engine queries and how to automatically correct them. Documents containing only the words \"queries\" or \"in\" are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "65", "default_text": "information in different language", "description": "Which papers cover Cross-language information retrieval", "narrative": "Relevant papers cover concepts, that fall under the category CLIR. Papers on language or information on their own or in another context are not relevant."}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "66", "default_text": "Abbreviations in queries", "description": "Which papers cover the handling of abbreviations in queries?", "narrative": "Relevant papers cover concepts, that deal with the occurrence of abbreviations in queries. Papers on abbreviations in general or on how to deal with abbreviations in documents are not relevant"}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "67", "default_text": "lemmatization algorithms", "description": "Which papers cover lemmatization algorithms?", "narrative": "Relevant IR documents cover the topic of lemmatization algorithms. Papers on the basic funktion of lemmatization algorithms and their integration into search engines"}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "68", "default_text": "filter ad rich documents", "description": "None", "narrative": "How to filter webpages that have tons of ads and pop ups out of ir search with maintaining low search time"}
{"dataset": "ir-lab-jena-leipzig-sose-2023/iranthology-20230618-training", "qid": "18", "default_text": "Advancements in Information Retrieval", "description": "None", "narrative": "Relevant texts contain Innovations or Advancements in Information Retrieval in recent years (e.g. after 2010)"}
